# MICROSOFT MOVIE STUDIO ANALYSIS

## INTRODUCTION

## Business Problem

### Objectives

To solve the above problem and help in steering Microsoft in the right direction in this endeavour, the following are this project's objectives

<b>Main Objective</b>
> Pass

<b>Specific Objectives</b>
1. To ...
2. To ...
3. To ...

## Experimental Design

The research follows the steps as listed:
1. Introduction and Business Problem
2. Loading Data and Relevant Libraries
3. Data Wrangling and Preparation
4. Data Exploration and Visualization
5. Conclusions
6. Recommendations

## Metric of Success
The project will be considered a success once it yields at least three actionable and data-driven recommendations to Mircosoft which can ensure the company focuses on the right steps while breaking into the Movie Industry

## Loading Libraries

In [1]:
import pandas as pd
import numpy as np
import sqlite3
import seaborn as sns
from matplotlib import pyplot as plt
%matplotlib inline

## Loading Data

In [3]:
# Creating a connection to database file
conn = sqlite3.connect("./data/im.db")


# Query for all tables
tablesQuery = """
SELECT name FROM sqlite_master
WHERE type='table';
"""

# Executing query
pd.read_sql(tablesQuery, conn)

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

> From the abov, there are 8 tables, investigating them reveals the following:

### DataBase Files

**Writers Table**

In [12]:
table1 = """
Select * FROM writers
LIMIT 10;
"""
pd.read_sql(table1, conn)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0438973  nm0175726
2  tt0438973  nm1802864
3  tt0462036  nm1940585
4  tt0835418  nm0310087
5  tt0835418  nm0841532
6  tt0878654  nm0284943
7  tt0878654  nm0284943
8  tt0878654  nm0284943
9  tt0996958  nm2286991

> The table above is giving information about the writers responsible for various movies using respective IDs.

**Directors Table**

In [8]:
table2 = """
SELECT * FROM directors
LIMIT 10
"""

pd.read_sql(table2, conn)

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502
5  tt0878654  nm2291498
6  tt0878654  nm2292011
7  tt0879859  nm2416460
8  tt0996958  nm2286991
9  tt0996958  nm2286991

> The table above is giving information about the directors responsible for various movies using respective IDs.

**Movie Basics Table**

In [9]:
table3 = """
SELECT * FROM movie_basics
LIMIT 10;
"""

pd.read_sql(table3, conn)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
5,tt0111414,A Thin Life,A Thin Life,2018,75.0,Comedy
6,tt0112502,Bigfoot,Bigfoot,2017,NaN,"Horror,Thriller"
7,tt0137204,Joe Finds Grace,Joe Finds Grace,2017,83.0,"Adventure,Animation,Comedy"
8,tt0139613,O Silêncio,O Silêncio,2012,NaN,"Documentary,History"
9,tt0144449,Nema aviona za Zagreb,Nema aviona za Zagreb,2012,82.0,Biography

> The above table gives information about basic attributes of movies:
* Titles
* Runtime in Minutes
* Genres spanned
* Start/Release Year

**Movie AKAs**

In [10]:
table4 = """
SELECT * FROM movie_akas
LIMIT 10;
"""
pd.read_sql(table4, conn)

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
5,tt0369610,15,Jurassic World,GR,None,imdbDisplay,None,0.0
6,tt0369610,16,Jurassic World,IT,None,imdbDisplay,None,0.0
7,tt0369610,17,Jurski svijet,HR,None,imdbDisplay,None,0.0
8,tt0369610,18,Olam ha'Yura,IL,he,imdbDisplay,None,0.0
9,tt0369610,19,Jurassic World: Mundo Jurásico,MX,None,imdbDisplay,None,0.0

> At first glance, the above table has no relevant information to use in the analysis that is not already in other preceeding tables

**Movie Ratings Table**

In [15]:
table5 = """
SELECT * FROM movie_ratings
LIMIT 10;
"""

pd.read_sql(table5, conn)

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21
5   tt1069246            6.2       326
6   tt1094666            7.0      1613
7   tt1130982            6.4       571
8   tt1156528            7.2       265
9   tt1161457            4.2       148

> The above table seems to be conveying the average rating for a movie as well as the number of votes contributing to said rating

**Known For**

In [16]:
table6 = """
SELECT * FROM known_for
LIMIT 10;
"""

pd.read_sql(table6, conn)

   person_id   movie_id
0  nm0061671  tt0837562
1  nm0061671  tt2398241
2  nm0061671  tt0844471
3  nm0061671  tt0118553
4  nm0061865  tt0896534
5  nm0061865  tt6791238
6  nm0061865  tt0287072
7  nm0061865  tt1682940
8  nm0062070  tt1470654
9  nm0062070  tt0363631

> Going off on a limb, the data above probably represents actors and which works they are famous for.

**Principals**

In [17]:
table7 = """
SELECT * FROM principals
LIMIT 10;
"""

pd.read_sql(table7, conn)

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
5,tt0323808,2,nm2694680,actor,None,"[""Steve Thomson""]"
6,tt0323808,3,nm0574615,actor,None,"[""Sir Lachlan Morrison""]"
7,tt0323808,4,nm0502652,actress,None,"[""Lady Delia Morrison""]"
8,tt0323808,5,nm0362736,director,None,None
9,tt0323808,6,nm0811056,producer,producer,None

> The above data will not be used in the analysis to follow.

**Persons**

In [18]:
table8 = """
SELECT * FROM persons
LIMIT 10;
"""

pd.read_sql(table8, conn)

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,None,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,None,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,None,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,None,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,None,"production_designer,art_department,set_decorator"
5,nm0062879,Ruel S. Bayani,NaN,None,"director,production_manager,miscellaneous"
6,nm0063198,Bayou,NaN,None,actor
7,nm0063432,Stevie Be-Zet,NaN,None,"composer,soundtrack"
8,nm0063618,Jeff Beal,1963.0,None,"composer,music_department,soundtrack"
9,nm0063750,Lindsay Beamish,NaN,None,"actress,miscellaneous"

> This table details what professions key individuals in the database do and when they were born/laid to rest; it is not relevant to the ensuing analysis.

## Loading Data

### From Database

## From Flat Files